---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.TopographyLinkType
source: html/b451e054-d4db-2c10-29d4-3a6110e94c5a.htm
---
# TopographyLinkType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.